CSI API ETABS v1

# cLineElmCount Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int Count()

    Function Count As Integer

    Dim instance As cLineElm
    Dim returnValue As Integer

    returnValue = instance.Count()

    int Count()

    abstract Count : unit -> int

#### Return Value

Type: Int32

See Also

#### Reference

cLineElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com